insert into supply (supply_id, title, author, price, amount)
values (1, 'Лирика', 'Пастернак Б.Л.', 518.99, 2),
    (2, 'Черный человек', 'Есенин С.А.', 570.20, 6),
    (3, 'Белая гвардия', 'Булгаков М.А.', 540.50, 7),
    (4, 'Идиот', 'Достоевский Ф.М.', 360.80, 3)


-- примеры с сайта:
insert supply values 
(null, 'Лирика', 'Пастернак Б.Л.', 518.99, 2),
(null, 'Черный человек', 'Есенин С.А.', 570.20, 6),
(null, 'Белая гвардия', 'Булгаков М.А.', 540.50, 7),
(null, 'Идиот', 'Достоевский Ф.М.', 360.80, 3);

-- select * from supply;

INSERT supply 
VALUES
    (default, 'Лирика', 'Пастернак Б.Л.', 518.99, 2),
    (default, 'Черный человек', 'Есенин С.А.', 570.20, 6),
    (default, 'Белая гвардия', 'Булгаков М.А.', 540.50, 7),
    (default, 'Идиот', 'Достоевский Ф.М.', 360.80, 3);
-- SELECT * FROM supply;
